app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    if params[:tag]
       @items = Item.tagged_with(params[:tag])
    else
       @items = Item.all