app/controllers/searches_controller.rb

def create
	@search = Search.new(search_params)
	@search.save
---
INSERT INTO "searches" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-06-06 23:10:48.964705"], ["name", "book"], ["updated_at", "2015-06-06 23:10:48.964705"]]

  def set_search
  	@search = Search.find(params[:id])
---
SELECT  "searches".* FROM "searches"  WHERE "searches"."id" = $1 LIMIT 1  [["id", 1]]