app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1
SELECT "items".* FROM "items"  WHERE "items"."user_id" = 4
---
  def show
    @user = User.find(params[:id])
    @items = Item.where(user_id: params[:id])